tap "homebrew/bundle"
# Code searching, linting, rewriting
brew "ast-grep"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# CLI tool that moves files or folder to the trash
brew "trash"
# Watch files and take action when they change
brew "watchman"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Control your tools with a few keystrokes
cask "raycast"
# Rust-based terminal
cask "warp"
# OpenJDK distribution from Azul
cask "zulu@17"
vscode "be5invis.vscode-custom-css"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "keifererikson.nightfox"
vscode "leonardssh.vscord"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.live-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "oven.bun-vscode"
vscode "oxc.oxc-vscode"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "rust-lang.rust-analyzer"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "tompollak.lazygit-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
vscode "ziglang.vscode-zig"
